using System.ComponentModel.DataAnnotations;

namespace DealParser.Config
{
    public class AppOptions
    {
        /// <summary> Путь к секции конфигурации </summary>
        public const string SectionName = "AppOptions";
        
        /// <summary> Строка подключения к бд </summary>
        public string ConnectionString { get; set; } = string.Empty;
        
        /// <summary> Размер запрашиваемого чанка записей </summary>
        public int ChunkSize { get; set; }
    
        /// <summary> Расписание запуска парсинга </summary>
        [RegularExpression("^([\\*]|([0]*([0-6]|[1-5][0-9])([,][0]*([0-6]|[1-5][0-9]))*([-][0]*([0-6]|[1-5][0-9]))?([,][0]*([0-6]|[1-5][0-9]))*(\\/[\\d]+)?)) " +
                           "([\\*]|([0]*([0-9]|[1][0-9]|[2][0-3])([,][0]*([0-9]|[1][0-9]|[2][0-3]))*([-][0]*([0-9]|[1][0-9]|[2][0-3]))?([,][0]*([0-9]|[1][0-9]|[2][0-3]))*(\\/[\\d]+)?)) " +
                           "([\\*]|([0]*([1-9]|[12][0-9]|[3][01])([,][0]*([1-9]|[12][0-9]|[3][01]))*([-][0]*([1-9]|[12][0-9]|[3][01]))?([,][0]*([1-9]|[12][0-9]|[3][01]))*(\\/[\\d]+)?)) " +
                           "([\\*]|([0]*([1-9]|[1][0-2])([,][0]*([1-9]|[1][0-2]))*([-][0]*([1-9]|[1][0-2]))?([,][0]*([1-9]|[1][0-2]))*(\\/[\\d]+)?)) " +
                           "([\\*]|([0]*([0-7])([,][0]*([0-7]))*([-][0]*([0-7]))?([,][0]*([0-7]))*(\\/[\\d]+)?))$")]
        public string Schedule { get; set; } = string.Empty;
    }
}